create_rc_corner -name rcbest0 -T {0} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {1.0} -preRoute_clkcap {1.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {1.0} -postRoute_clkcap {1.0} -qx_tech_file {gpdk045.tch}
create_rc_corner -name rcworst125 -T {125} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {1.0} -preRoute_clkcap {1.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {1.0} -postRoute_clkcap {1.0} -qx_tech_file {gpdk045.tch}
create_library_set -name BC -timing {fast_vdd1v0_basicCells.lib}create_library_set -name WC -timing {slow_vdd1v0_basicCells.lib}create_constraint_mode -name func -sdc_files ALU_TOP_m.sdccreate_delay_corner -name BC_rcbest0.hold -library_set {BC} -rc_corner {rcbest0}create_delay_corner -name WC_rcworst125.setup -library_set {WC} -rc_corner {rcworst125}create_analysis_view -name func@BC_rcbest0.hold -constraint_mode {func} -delay_corner {BC_rcbest0.hold}
create_analysis_view -name func@WC_rcworst125.setup -constraint_mode {func} -delay_corner {WC_rcworst125.setup}
set_analysis_view -setup {func@WC_rcworst125.setup} -hold {func@BC_rcbest0.hold}
