# Cadence Genus(TM) Synthesis Solution, Version 16.13-s036_1, built Dec 20 2016

# Date: Tue Jun 13 09:23:40 2023
# Host: CadenceServer3.localdomain (x86_64 w/Linux 2.6.32-642.el6.x86_64) (8cores*16cpus*Intel(R) Xeon(R) CPU E5-2630 v3 @ 2.40GHz 20480KB)
# OS:   CentOS release 6.8 (Final)

source TOP.tcl
source TOP.tcl
gui_hide 
report_power
report_area
report_timing
report timing 
report gates 
report timing -summary
report timing
clear
gui_show 
exit
